eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
/*
 * Copyright (c) 2022 Infineon Technologies AG. All Rights Reserved.
 *
 * Use of this file is subject to the terms of use agreed between (i) you or the company in which ordinary course of
 * business you are acting and (ii) Infineon Technologies AG, its affiliates or its licensees. If and as long as no
 * such terms of use are agreed, use of this file is subject to the Evaluation Software License Agreement distributed
 * along with this file within the software delivery package.
 *
 */

#include "Ifx_MAS_ModulatorF16.h"

/* Math library includes */
#include "Ifx_Math_All.h"
#include "Ifx_Math_Cfg.h"

/* CMSIS includes */
#include "cmsis_compiler.h"

/* Size of the lookup table used  */
#define IFX_MAS_MODULATORF16_TABLESIN60SQRT3_LUT_SIZE  (12)

/* Maximum index of the lookup table used, 2^(size) -1  */
#define IFX_MAS_MODULATORF16_TABLESIN60SQRT3_MAX_INDEX (4095U)

/* Macro to convert angle value to lookup table index */
#define IFX_MAS_MODULATORF16_ANGLE_TO_INDEX            (15U - IFX_MAS_MODULATORF16_TABLESIN60SQRT3_LUT_SIZE)

/* Modulation index max for linear region, normalized by 2/pi */
#define IFX_MAS_MODULATORF16_CONST_MI_0907_Q15         (18921)

/* Ratio from period ticks to compare value */
#define IFX_MAS_MODULATORF16_MAX_COMPARE_VALUE_RATIO   (2)
#define IFX_MAS_MODULATORF16_MED_COMPARE_VALUE_RATIO   (4)

/* Macros to detect individual faults */
#define IFX_MAS_MODULATORF16_MAXAMPLITUDE_FAULT_STS    (0x20U)
#define IFX_MAS_MODULATORF16_OVERMODULATION_FAULT_STS  (0x40U)

/* Macros to define the component ID */
#define IFX_MAS_MODULATORF16_COMPONENTID_SOURCEID      ((uint8)Ifx_ComponentID_SourceID_infineonTechnologiesAG)
#define IFX_MAS_MODULATORF16_COMPONENTID_LIBRARYID     ((uint16)Ifx_ComponentID_LibraryID_mctrlActuatorSensor)
#define IFX_MAS_MODULATORF16_COMPONENTID_MODULEID      (0U)
#define IFX_MAS_MODULATORF16_COMPONENTID_COMPONENTID1  (1U)

#define IFX_MAS_MODULATORF16_COMPONENTID_COMPONENTID2  ((uint8)Ifx_ComponentID_ComponentID2_basic)

/* Macros to define the component version */
#define IFX_MAS_MODULATORF16_COMPONENTVERSION_MAJOR    (1U)
#define IFX_MAS_MODULATORF16_COMPONENTVERSION_MINOR    (3U)
#define IFX_MAS_MODULATORF16_COMPONENTVERSION_PATCH    (0U)
#define IFX_MAS_MODULATORF16_COMPONENTVERSION_T        (0U)
#define IFX_MAS_MODULATORF16_COMPONENTVERSION_REV      (0U)

/* *INDENT-OFF* */
/* Component ID */
static const Ifx_ComponentID      Ifx_MHA_ModulatorF16_componentID = {
    .sourceID     = IFX_MAS_MODULATORF16_COMPONENTID_SOURCEID,
    .libraryID    = IFX_MAS_MODULATORF16_COMPONENTID_LIBRARYID,
    .moduleID     = IFX_MAS_MODULATORF16_COMPONENTID_MODULEID,
    .componentID1 = IFX_MAS_MODULATORF16_COMPONENTID_COMPONENTID1,
    .componentID2 = IFX_MAS_MODULATORF16_COMPONENTID_COMPONENTID2,
};

/* Component Version */
static const Ifx_ComponentVersion Ifx_MHA_ModulatorF16_componentVersion = {
    .major = IFX_MAS_MODULATORF16_COMPONENTVERSION_MAJOR,
    .minor = IFX_MAS_MODULATORF16_COMPONENTVERSION_MINOR,
    .patch = IFX_MAS_MODULATORF16_COMPONENTVERSION_PATCH,
    .t     = IFX_MAS_MODULATORF16_COMPONENTVERSION_T,
    .rev   = IFX_MAS_MODULATORF16_COMPONENTVERSION_REV
};
/* *INDENT-ON* */

/* polyspace-begin MISRA2012:D4.14 [Justified:Low] "The caller function has to guarantee that NULL is not passed as
 * argument." */

/* API to initialize configuration related to current measurement */
static inline void Ifx_MAS_ModulatorF16_initCurrMeasCfg(Ifx_MAS_ModulatorF16* self);

/* API to check the fault status */
static inline bool Ifx_MAS_ModulatorF16_checkFaultStatus(Ifx_MAS_ModulatorF16* self, uint32 faults);

/* APIs to check the fault status of each fault individually */
static inline bool Ifx_MAS_ModulatorF16_maxAmplitudeFaultStatus(Ifx_MAS_ModulatorF16* self, bool* faultStatusRet,
                                                                uint32 faults);
static inline bool Ifx_MAS_ModulatorF16_overmodulationFaultStatus(Ifx_MAS_ModulatorF16* self, bool* faultStatusRet,
                                                                  uint32 faults);

/* API to set the compare values and triggers */
static inline void Ifx_MAS_ModulatorF16_setActiveShort(Ifx_MAS_ModulatorF16* self, sint16 cmprValues);

/* API to check and limit the inputs */
static inline uint8 Ifx_MAS_ModulatorF16_limitInputs(Ifx_MAS_ModulatorF16* self, Ifx_Math_Fract16 refVoltageAmp,
                                                     Ifx_Math_Fract16 dcLinkVoltage,
                                                     Ifx_Math_Fract16* voltageOverDcLinkVoltage);

/* API to calculate compare values based on symmetric switching */
static inline void Ifx_MAS_ModulatorF16_symmetricSwitching(sint16* cmprVal, sint16* switchingTimes, uint8 sector);

#if IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK != 0

/* API to modify the switching times to get a minimum sensing time (minimum on time feature active) */
static inline void Ifx_MAS_ModulatorF16_modSwitch(Ifx_MAS_ModulatorF16* self, sint16* compVal, sint16* switchingTimes,
                                                  uint8 isSevenSegment);
#else

/* API to modify the switching times to get a minimum sensing time (minimum on time feature inactive) */
static inline void Ifx_MAS_ModulatorF16_modSwitch(Ifx_MAS_ModulatorF16* self, sint16* compVal,
                                                  sint16* switchingTimes);
#endif /* IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK != 0 */
/* API to limit the switching times */
static inline void Ifx_MAS_ModulatorF16_limitSwitchTimes(Ifx_MAS_ModulatorF16* self, sint16* cmprVal);

/* API to calculate the triggers based on sector */
static inline void Ifx_MAS_ModulatorF16_calcTriggers(Ifx_MAS_ModulatorF16* self, sint16* cmprVal);

/* API to set the triggers for current measurement */
static inline void Ifx_MAS_ModulatorF16_measBegin(Ifx_MAS_ModulatorF16* self, sint16* cmprVal);

/* API to assign the compare values and triggers */
static inline void Ifx_MAS_ModulatorF16_assignOutputs(Ifx_MAS_ModulatorF16* self, sint16* cmprVal);

/* API to calculate the effective times of the inverter switching states */
static inline void Ifx_MAS_ModulatorF16_updatePolar7SegQ16(Ifx_MAS_ModulatorF16* self, uint32 angle, Ifx_Math_Fract16
                                                           voltageOverDcLinkVoltage, Ifx_Math_3PhaseFract16 currents);

