eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
#if IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION == 1

/* API to calculate the 7 segment switching times based on t_R, t_L, t_0, and sector */
static inline void Ifx_MAS_ModulatorF16_calcSwitchTimes(Ifx_MAS_ModulatorF16* self, sint16* switchingTimes,
                                                        Ifx_Math_3PhaseFract16 currents, Ifx_Math_Fract16
                                                        voltageOverDcLinkVoltage);
static inline void Ifx_MAS_ModulatorF16_compDeadTime(Ifx_MAS_ModulatorF16* self, sint16* cmprVal,
                                                     Ifx_Math_3PhaseFract16 currents);

/* API to compensate for the deadtime */
static inline void Ifx_MAS_ModulatorF16_compPhaseDeadTime(Ifx_MAS_ModulatorF16* self, sint16* cmprVal,
                                                          Ifx_Math_Fract16 phaseCurrent, uint8 phaseOffset);
#else

/* API to calculate the 7 segment switching times based on t_R, t_L, t_0, and sector */
static inline void Ifx_MAS_ModulatorF16_calcSwitchTimes(Ifx_MAS_ModulatorF16* self, sint16* switchingTimes,
                                                        Ifx_Math_Fract16 voltageOverDcLinkVoltage);
#endif /* IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION */

#if IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK != 0

/* API to set the triggers for current measurement */
static inline uint8 Ifx_MAS_ModulatorF16_checkMinOnTime(Ifx_MAS_ModulatorF16* self, sint16* cmprVal);

#endif /* IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK */
/* API to modify the switching times at low amplitudes */
static inline void Ifx_MAS_ModulatorF16_modSwitchSmallAmplitude(Ifx_MAS_ModulatorF16* self,
                                                                sint16              * cmprVal);
static inline void                       Ifx_MAS_ModulatorF16_measEnd(Ifx_MAS_ModulatorF16* self, sint16* cmprVal);
static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateOff(Ifx_MAS_ModulatorF16* self, bool
                                                                       enterFaultState, uint32 angle, Ifx_Math_Fract16
                                                                       voltageOverDcLinkVoltage,
                                                                       Ifx_Math_3PhaseFract16 currents);
static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateOn(Ifx_MAS_ModulatorF16* self, bool
                                                                      enterFaultState, uint32 angle, Ifx_Math_Fract16
                                                                      voltageOverDcLinkVoltage, Ifx_Math_3PhaseFract16
                                                                      currents);
static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateBrake(Ifx_MAS_ModulatorF16* self, bool
                                                                         enterFaultState);
static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateFault(Ifx_MAS_ModulatorF16* self);

/* Function to get the component ID */
void Ifx_MAS_ModulatorF16_getID(const Ifx_ComponentID** componentID)
{
    *componentID = &Ifx_MHA_ModulatorF16_componentID;
}


/* Function to get the component version */
void Ifx_MAS_ModulatorF16_getVersion(const Ifx_ComponentVersion** componentVersion)
{
    *componentVersion = &Ifx_MHA_ModulatorF16_componentVersion;
}


/* Initialize the modulator */
void Ifx_MAS_ModulatorF16_init(Ifx_MAS_ModulatorF16* self)
{
    /* Initialize the period */
    self->p_period_tick = IFX_MAS_MODULATORF16_CFG_PERIOD_TICK;

    /* Initialize the deadtime */
    self->p_deadTime_tick = IFX_MAS_MODULATORF16_CFG_DEADTIME_TICK;

    /* Active low and trigs to 0 */
    Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);

    /* Set the state machine to INIT */
    self->p_status.state              = Ifx_MAS_ModulatorF16_State_init;
    self->p_status.maxAmplitudeFlag   = false;
    self->p_status.overmodulationFlag = false;

    /* Disable module */
    Ifx_MAS_ModulatorF16_enable(self, false);

    /* Initialize current measurement configuration */
    Ifx_MAS_ModulatorF16_initCurrMeasCfg(self);

    /* Minimum sensing time */
    Ifx_MAS_ModulatorF16_p_recalculateMinSenseTime(self);

    /* Maximum amplitude */
    self->p_maxAmplitudeQ15 = IFX_MAS_MODULATORF16_CFG_MAX_AMPLITUDE_Q15;

    /* Initialize internal variables */
    self->p_clearFault = false;

    /* Set flag for second trigger */
    self->p_output.currentReconstructionInfo.secondTriggerIsSum = true;

    /* Set substate to bidirectional two phase shift */
    self->p_status.subState = Ifx_MAS_ModulatorF16_SubState_bidirectionalTwoPhase;

    /* Set the value for deadtime compensation */
    self->p_deadTimeCompensation = IFX_MAS_MODULATORF16_CFG_DEADTIME_TICK / 2;

    /* Minimum on time */
    self->p_minTurnOnTimeHalf_tick = (IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK +
                                      IFX_MAS_MODULATORF16_CFG_DEADTIME_TICK) / 2;

    /* Disable brake */
    self->p_enableBrake = false;
}


static inline void Ifx_MAS_ModulatorF16_initCurrMeasCfg(Ifx_MAS_ModulatorF16* self)
{
    /* Current measurement config */
    self->p_currentMeasurement.p_driverDelay_tick     = IFX_MAS_MODULATORF16_CFG_DRIVERDELAY_TICK;
    self->p_currentMeasurement.p_ringingTime_tick     = IFX_MAS_MODULATORF16_CFG_RINGINGTIME_TICK;
    self->p_currentMeasurement.p_measurementTime_tick = IFX_MAS_MODULATORF16_CFG_MEASUREMENTTIME_TICK;

    /* Delta to be added if measuring from the beginning */
    Ifx_MAS_ModulatorF16_p_recalculateDeltaBegin(self);

    /* Current measurement trigger point */
    self->p_currentMeasurement.p_measurementPoint =
        (Ifx_MAS_ModulatorF16_measurementPoint)IFX_MAS_MODULATORF16_CFG_MEASUREMENTPOINT;

    /* Delta to be subtracted if measuring from the end */
    Ifx_MAS_ModulatorF16_p_recalculateDeltaEnd(self);
}


static inline bool Ifx_MAS_ModulatorF16_checkFaultStatus(Ifx_MAS_ModulatorF16* self, uint32 faults)
{
    /* boolean output fault status initialized to false */
    bool faultStatusRet = false;

    /* Check if any fault occurred */
    if (faults != 0u)
    {
        /* 1. check for maximum amplitude */
        self->p_status.maxAmplitudeFlag = Ifx_MAS_ModulatorF16_maxAmplitudeFaultStatus(self, &faultStatusRet, faults);

        /* 2. check for overmodulation */
        self->p_status.overmodulationFlag = Ifx_MAS_ModulatorF16_overmodulationFaultStatus(self, &faultStatusRet,
            faults);
    }

    /* Check if a fault clear request was placed */
    else if (self->p_clearFault == true)
    {
        /* Clear all faults in status in case a fault clear request was done */
        self->p_status.maxAmplitudeFlag   = false;
        self->p_status.overmodulationFlag = false;
    }
    else
    {
        /* Final else-clause */
    }

