eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
    /* return the fault status */
    return faultStatusRet;
}


static inline bool Ifx_MAS_ModulatorF16_maxAmplitudeFaultStatus(Ifx_MAS_ModulatorF16* self, bool* faultStatusRet,
                                                                uint32 faults)
{
    /* Variable to store the max. amplitude fault status */
    bool faultMaxAmplitude = self->p_status.maxAmplitudeFlag;

    /* 1. check individually for maximum amplitude */
    /* 1.1 Check if this fault is configured as ENABLED */
#if IFX_MAS_MODULATORF16_CFG_FAULT_REACTION_MAX_AMPLITUDE >= IFX_MAS_MODULATORF16_FAULT_REACTION_ENABLE

    if ((faults & IFX_MAS_MODULATORF16_MAXAMPLITUDE_FAULT_STS) != 0)
    {
        /* Set the fault information status bit */
        faultMaxAmplitude = true;

        /* 1.2 Check if this fault is configured for REPORTING */
#if IFX_MAS_MODULATORF16_CFG_FAULT_REACTION_MAX_AMPLITUDE >= IFX_MAS_MODULATORF16_FAULT_REACTION_REPORT_ONLY

#if (IFX_MAS_MODULATORF16_CFG_ENABLE_FAULT_OUT == 1)

        /* report fault source ONLY the 1st time it occurs */
        if (self->p_status.maxAmplitudeFlag == false)
        {
            /* report the fault through the user interface */
            IFX_MAS_MODULATORF16_CFG_FAULT_OUT();
        }

#endif

        /* 1.3 Check if this fault is configured for REACTION */
#if IFX_MAS_MODULATORF16_CFG_FAULT_REACTION_MAX_AMPLITUDE >= IFX_MAS_MODULATORF16_FAULT_REACTION_REPORT_REACT

        /* set the fault status for reacting */
        *faultStatusRet = true;
#endif
#endif
    }

#endif

    return faultMaxAmplitude;
}


static inline bool Ifx_MAS_ModulatorF16_overmodulationFaultStatus(Ifx_MAS_ModulatorF16* self, bool* faultStatusRet,
                                                                  uint32 faults)
{
    /* Variable to store the max. amplitude fault status */
    bool faultOvermodulation = self->p_status.overmodulationFlag;

    /* 2 check individually for Overmodulation */
    /* 2.1 Check if this fault is configured as ENABLED */
#if IFX_MAS_MODULATORF16_CFG_FAULT_REACTION_OVERMODULATION >= IFX_MAS_MODULATORF16_FAULT_REACTION_ENABLE

    if ((faults & IFX_MAS_MODULATORF16_OVERMODULATION_FAULT_STS) != 0)
    {
        /* set the fault information status bit */
        faultOvermodulation = true;

#if IFX_MAS_MODULATORF16_CFG_FAULT_REACTION_OVERMODULATION >= IFX_MAS_MODULATORF16_FAULT_REACTION_REPORT_ONLY

#if (IFX_MAS_MODULATORF16_CFG_ENABLE_FAULT_OUT == 1)

        /* report fault source ONLY the 1st time it occurs */
        if (self->p_status.overmodulationFlag == false)
        {
            /* report the fault through the user interface */
            IFX_MAS_MODULATORF16_CFG_FAULT_OUT();
        }

#endif

        /* 2.3 Check if this fault is configured for REACTION */
#if IFX_MAS_MODULATORF16_CFG_FAULT_REACTION_OVERMODULATION >= IFX_MAS_MODULATORF16_FAULT_REACTION_REPORT_REACT

        /* set the fault status for reacting */
        *faultStatusRet = true;
#endif
#endif
    }

#endif

    return faultOvermodulation;
}


/* polyspace-begin CODE-METRIC:CALLING [Justified:Low] "This is a common function expected to be called multiple times."
 * */
static inline void Ifx_MAS_ModulatorF16_setActiveShort(Ifx_MAS_ModulatorF16* self, sint16 cmprValues)
{
    /* Set the compare up values */
    self->p_output.compareValues_tick[0] = (uint16)cmprValues;
    self->p_output.compareValues_tick[1] = (uint16)cmprValues;
    self->p_output.compareValues_tick[2] = (uint16)cmprValues;

    /* Set the compare down values */
    sint16 downCompareValue = self->p_period_tick - cmprValues;
    self->p_output.compareValues_tick[3] = (uint16)downCompareValue;
    self->p_output.compareValues_tick[4] = (uint16)downCompareValue;
    self->p_output.compareValues_tick[5] = (uint16)downCompareValue;

    /* Set the current triggers */
    self->p_output.triggerTime_tick[0] = 0;
    self->p_output.triggerTime_tick[1] = 0;
}


/* polyspace-end CODE-METRIC:CALLING [Justified:Low] "This is a common function expected to be called multiple times."
 * */
void Ifx_MAS_ModulatorF16_execute(Ifx_MAS_ModulatorF16* self, Ifx_Math_PolarFract16 refVoltage, Ifx_Math_Fract16
                                  dcLinkVoltageQ15, Ifx_Math_3PhaseFract16 currents)
{
    /* Stores the occurred faults */
    uint8                      faultStatus;

    /* Stores if the state machine will be set to false */
    bool                       enterFaultState;

    /* Variable to store the state */
    Ifx_MAS_ModulatorF16_State previousState = (self->p_status.state);
    Ifx_MAS_ModulatorF16_State nextState     = previousState;

    /* Stores the ratio between amplitude of needed voltage and dc voltage */
    Ifx_Math_Fract16           voltageOverDcLinkVoltage;

    /* Limit the inputs and check if any fault occurred */
    faultStatus = Ifx_MAS_ModulatorF16_limitInputs(self, refVoltage.amplitude, dcLinkVoltageQ15,
        &voltageOverDcLinkVoltage);

    /* Update the actual output voltage angle to the ref. voltage angle */
    self->p_output.actualVoltage.angle = refVoltage.angle;

    /* Check fault configuration and return if state machine will be set to false */
    enterFaultState = Ifx_MAS_ModulatorF16_checkFaultStatus(self, faultStatus);

    /* Handles the state machine */
    switch (previousState)
    {
        /* Initialize the module */
        case Ifx_MAS_ModulatorF16_State_init:

            /* do state transition to OFF at the 1st state machine execution cycle */
            nextState = Ifx_MAS_ModulatorF16_State_off;
            break;

        /* Modulator not running */
        case Ifx_MAS_ModulatorF16_State_off:

            /* Call API when state is in off */
            nextState = Ifx_MAS_ModulatorF16_stateOff(self, enterFaultState, refVoltage.angle,
                voltageOverDcLinkVoltage, currents);
            break;

        /* Modulator running */
        case Ifx_MAS_ModulatorF16_State_on:
            nextState = Ifx_MAS_ModulatorF16_stateOn(self, enterFaultState, refVoltage.angle,
                voltageOverDcLinkVoltage, currents);
            break;

        /* Modulator in fault */
        case Ifx_MAS_ModulatorF16_State_fault:

            /* Call API when state is in off */
            nextState = Ifx_MAS_ModulatorF16_stateFault(self);
            break;

        /* Modulator in brake state*/
        case Ifx_MAS_ModulatorF16_State_brake:
            nextState = Ifx_MAS_ModulatorF16_stateBrake(self, enterFaultState);
            break;

