eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
        /* Invalid state, transition to init */
        default:

            /* Default transition to INIT */
            nextState = Ifx_MAS_ModulatorF16_State_init;

            /* Active low and trigs to 0 */
            Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
            break;
    }

    /* Clear internal clear fault variable */
    self->p_clearFault = false;

    /* Update state */
    self->p_status.state = nextState;
}


static inline uint8 Ifx_MAS_ModulatorF16_limitInputs(Ifx_MAS_ModulatorF16* self, Ifx_Math_Fract16 refVoltageAmp,
                                                     Ifx_Math_Fract16 dcLinkVoltage,
                                                     Ifx_Math_Fract16* voltageOverDcLinkVoltage)
{
    /* Stores the occurred faults */
    uint8            faultStatus = 0;

    /* Stores actual voltage */
    Ifx_Math_Fract16 limitedAmp;
    Ifx_Math_Fract16 modIndex;
    Ifx_Math_Fract16 dcCheckedAmp;
    Ifx_Math_Fract16 limModIndex;
    Ifx_Math_Fract16 actualVoltageAmp;

    /* Limit amplitude to the maximum amplitude parameter */
    if (refVoltageAmp > self->p_maxAmplitudeQ15)
    {
        limitedAmp   = self->p_maxAmplitudeQ15;
        faultStatus |= (uint8)IFX_MAS_MODULATORF16_MAXAMPLITUDE_FAULT_STS;
    }
    else
    {
        limitedAmp = refVoltageAmp;
    }

    /* Limit DC-Link voltage to positive numbers */
    if (dcLinkVoltage <= 0)
    {
        modIndex     = 0;
        dcCheckedAmp = 0;
    }

    /* Calculate the ratio between amplitude of needed voltage and dc voltage */
    else
    {
        modIndex     = Ifx_Math_DivShLSatNZ_F16(limitedAmp, dcLinkVoltage, 15u);
        dcCheckedAmp = limitedAmp;
    }

    /* Limit modulation index to the Linear Region */
    if (modIndex > IFX_MAS_MODULATORF16_CONST_MI_0907_Q15)
    {
        limModIndex  = IFX_MAS_MODULATORF16_CONST_MI_0907_Q15;
        faultStatus |= (uint8)IFX_MAS_MODULATORF16_OVERMODULATION_FAULT_STS;

        /* Write the actual voltage (DC-Link voltage * linear modulation limit) */
        actualVoltageAmp = Ifx_Math_Mul_F16(dcLinkVoltage, IFX_MAS_MODULATORF16_CONST_MI_0907_Q15);
    }
    else
    {
        limModIndex      = modIndex;
        actualVoltageAmp = dcCheckedAmp;
    }

    /* Write actual voltage output and modulation index */
    *voltageOverDcLinkVoltage              = limModIndex;
    self->p_output.actualVoltage.amplitude = actualVoltageAmp;

    return faultStatus;
}


static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateOff(Ifx_MAS_ModulatorF16* self, bool
                                                                       enterFaultState, uint32 angle, Ifx_Math_Fract16
                                                                       voltageOverDcLinkVoltage,
                                                                       Ifx_Math_3PhaseFract16 currents)
{
    Ifx_MAS_ModulatorF16_State nextState;

    /* Transition to FAULT and execute configured software reaction */
    if (enterFaultState == true)
    {
        nextState = Ifx_MAS_ModulatorF16_State_fault;
#if IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
#elif IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_ModulatorF16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, (self->p_period_tick /
                                                   IFX_MAS_MODULATORF16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to brake and execute configured software reaction */
    else if ((self->p_enableBrake == true)
             && (self->p_enable == true))
    {
        nextState = Ifx_MAS_ModulatorF16_State_brake;
#if IFX_MAS_MODULATORF16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
#elif IFX_MAS_MODULATORF16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_ModulatorF16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATORF16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, (self->p_period_tick /
                                                   IFX_MAS_MODULATORF16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to ON if module enabled on the next execution cycle */
    else if (self->p_enable == true)
    {
        nextState = Ifx_MAS_ModulatorF16_State_on;

        /* Set substate to bidirectional two phase shift */
        self->p_status.subState = Ifx_MAS_ModulatorF16_SubState_bidirectionalTwoPhase;

        /* Calculate the new compare values */
        Ifx_MAS_ModulatorF16_updatePolar7SegQ16(self, angle, voltageOverDcLinkVoltage, currents);
    }
    else
    {
        /* Stay in off */
        nextState = Ifx_MAS_ModulatorF16_State_off;
    }

    return nextState;
}


static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateOn(Ifx_MAS_ModulatorF16* self, bool
                                                                      enterFaultState, uint32 angle, Ifx_Math_Fract16
                                                                      voltageOverDcLinkVoltage, Ifx_Math_3PhaseFract16
                                                                      currents)
{
    Ifx_MAS_ModulatorF16_State nextState;

    /* Transition to FAULT and execute configured software reaction */
    if (enterFaultState == true)
    {
        nextState = Ifx_MAS_ModulatorF16_State_fault;
#if IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
#elif IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_ModulatorF16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, (self->p_period_tick /
                                                   IFX_MAS_MODULATORF16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to brake and execute configured software reaction */
    else if ((self->p_enableBrake == true)
             && (self->p_enable == true))
    {
        /* Set the state to brake */
        nextState = Ifx_MAS_ModulatorF16_State_brake;
#if IFX_MAS_MODULATORF16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
#elif IFX_MAS_MODULATORF16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_ModulatorF16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATORF16_CFG_BRAKE_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, (self->p_period_tick /
                                                   IFX_MAS_MODULATORF16_MED_COMPARE_VALUE_RATIO));
#endif
    }

