eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
    /* Modulator enabled */
    else if (self->p_enable == true)
    {
        /* Calculate the new compare values */
        Ifx_MAS_ModulatorF16_updatePolar7SegQ16(self, angle, voltageOverDcLinkVoltage, currents);

        /* Set the state to on */
        nextState = Ifx_MAS_ModulatorF16_State_on;
    }
    else

    /* Modulator disabled */
    {
        /* Set the state to OFF */
        nextState = Ifx_MAS_ModulatorF16_State_off;

        /* Active low and trigs to 0 */
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
    }

    return nextState;
}


static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateBrake(Ifx_MAS_ModulatorF16* self, bool
                                                                         enterFaultState)
{
    Ifx_MAS_ModulatorF16_State nextState;

    /* Transition to FAULT and execute configured software reaction */
    if (enterFaultState == true)
    {
        nextState = Ifx_MAS_ModulatorF16_State_fault;
#if IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
#elif IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH
        Ifx_MAS_ModulatorF16_setActiveShort(self, 0);
#elif IFX_MAS_MODULATORF16_CFG_FAULT_OUT_BEHAVIOR == IFX_MAS_MODULATORF16_OUTPUT_BEHAVIOR_ACTIVE_SHORT_HIGH_LOW
        Ifx_MAS_ModulatorF16_setActiveShort(self, (self->p_period_tick /
                                                   IFX_MAS_MODULATORF16_MED_COMPARE_VALUE_RATIO));
#endif
    }

    /* Transition to OFF and execute configured software reaction */
    else if ((self->p_enableBrake == false)
             && (self->p_enable == false))
    {
        /* do state transition to OFF */
        nextState = Ifx_MAS_ModulatorF16_State_off;

        /* Active low and trigs to 0 */
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
    }

    /* Transition to ON if module enabled on the next execution cycle */
    else if (self->p_enableBrake == false)
    {
        nextState = Ifx_MAS_ModulatorF16_State_on;

        /* Set substate to bidirectional two phase shift */
        self->p_status.subState = Ifx_MAS_ModulatorF16_SubState_bidirectionalTwoPhase;
    }
    else
    {
        /* stay in brake */
        nextState = Ifx_MAS_ModulatorF16_State_brake;
    }

    return nextState;
}


static inline Ifx_MAS_ModulatorF16_State Ifx_MAS_ModulatorF16_stateFault(Ifx_MAS_ModulatorF16* self)
{
    Ifx_MAS_ModulatorF16_State nextState;

    if (self->p_clearFault == true)
    {
        /* do state transition to OFF */
        nextState = Ifx_MAS_ModulatorF16_State_off;

        /* Active low and trigs to 0 */
        Ifx_MAS_ModulatorF16_setActiveShort(self, self->p_period_tick);
    }
    else
    {
        nextState = Ifx_MAS_ModulatorF16_State_fault;
    }

    return nextState;
}


__USED static inline void Ifx_MAS_ModulatorF16_updatePolar7SegQ16(Ifx_MAS_ModulatorF16* self, uint32 angle,
                                                                  Ifx_Math_Fract16 voltageOverDcLinkVoltage,
                                                                  Ifx_Math_3PhaseFract16 currents)
{
    /* Sector number [0..5] */
    uint8  sector;

    /* Lookup table index */
    uint16 tableIndex;

    /* Array to store the switching times ={t_Right, t_Left, t_0} */
    sint16 switchingTimes[3];
    uint32 angleTimesSix;

    /* Calculate sector number */
    angleTimesSix = (angle >> 17) * 6;
    sector        = (uint8)(angleTimesSix >> 15);

    /* Assign sector value */
    self->p_output.currentReconstructionInfo.sector = sector;

    /* Calculate angle in sin lookup table: index [0..4095] */
    tableIndex = (uint16)(angleTimesSix >>
                          (IFX_MAS_MODULATORF16_ANGLE_TO_INDEX)&IFX_MAS_MODULATORF16_TABLESIN60SQRT3_MAX_INDEX);

    /* Get sine and cosine values from the lookup table */
    Ifx_Math_Fract16 sinValue = Ifx_MAS_ModulatorF16_lutSin60Sqrt3[tableIndex];
    Ifx_Math_Fract16 cosValue = Ifx_MAS_ModulatorF16_lutSin60Sqrt3[(IFX_MAS_MODULATORF16_TABLESIN60SQRT3_MAX_INDEX -
                                                                    tableIndex)];

    /* Calculate effective switching times, t_R, t_L, and t_0 */
    /* t_Right */
    switchingTimes[0] = Ifx_Math_MulShR_F16((self->p_period_tick / IFX_MAS_MODULATORF16_MAX_COMPARE_VALUE_RATIO),
        Ifx_Math_Mul_F16(voltageOverDcLinkVoltage, cosValue), 14u);

    /* t_Left */
    switchingTimes[1] = Ifx_Math_MulShR_F16((self->p_period_tick / IFX_MAS_MODULATORF16_MAX_COMPARE_VALUE_RATIO),
        Ifx_Math_Mul_F16(voltageOverDcLinkVoltage, sinValue), 14u);

    /* t_0 */
    switchingTimes[2] = ((self->p_period_tick / IFX_MAS_MODULATORF16_MAX_COMPARE_VALUE_RATIO) - switchingTimes[0] -
                         switchingTimes[1]) / 2;

#if IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION == 1
    Ifx_MAS_ModulatorF16_calcSwitchTimes(self, switchingTimes, currents, voltageOverDcLinkVoltage);
#else
    Ifx_MAS_ModulatorF16_calcSwitchTimes(self, switchingTimes, voltageOverDcLinkVoltage);
    (void)currents;
#endif /* IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION */
}


#if IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION == 1
static inline void Ifx_MAS_ModulatorF16_calcSwitchTimes(Ifx_MAS_ModulatorF16* self, sint16* switchingTimes,
                                                        Ifx_Math_3PhaseFract16 currents, Ifx_Math_Fract16
                                                        voltageOverDcLinkVoltage)
#else
static inline void Ifx_MAS_ModulatorF16_calcSwitchTimes(Ifx_MAS_ModulatorF16*self, sint16*switchingTimes,
                                                        Ifx_Math_Fract16 voltageOverDcLinkVoltage)
#endif /* IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION */
{
    /* Temporary values to hold the compare values. The array is organized as following:
     * The three phase pulses have different length: long, middle, short.
     * 0 and 3: switch on/off time of the long pulse.
     * 1 and 4: switch on/off time of the middle pulse.
     * 2 and 5: switch on/off time of the short pulse.
     */
    sint16 cmprVal[6];

    /* Calculate compare values based on symmetric switching */
    Ifx_MAS_ModulatorF16_symmetricSwitching(cmprVal, switchingTimes, self->p_output.currentReconstructionInfo.sector);

