eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
        /* Modify count down */
        cmprVal[3] = cmprVal[3] - marginMeasurementWindowLeft;
    }

    /* After the shift of the long pulse, the last switching event could be the fixed pulse or the shift-to-left
     * pulse, find the second last switching event to decide the current measurement window */
    if (cmprVal[3] > cmprVal[4])
    {
        secondLastCmprVal = cmprVal[3];
        lastCmprVal       = cmprVal[4];
    }
    else
    {
        secondLastCmprVal = cmprVal[4];
        lastCmprVal       = cmprVal[3];
    }

    /* Get the current measurement window for the second measurement trigger */
    marginMeasurementWindowRight = cmprVal[5] - secondLastCmprVal - self->p_minSenseTime_tick;

    /* Shift short pulse to the right if the window is not enough */
    if (marginMeasurementWindowRight < 0)
    {
        /* Find the last compare value, the phase to be shifted right should orient on the last compare value */
        sint16 marginMeasurementWindowRightNew = cmprVal[2] - lastCmprVal + self->p_minSenseTime_tick;

        /* Modify count up */
        cmprVal[2] = cmprVal[2] + marginMeasurementWindowRightNew;

        /* Modify count down */
        cmprVal[5] = cmprVal[5] - marginMeasurementWindowRightNew;

        /* Set the flag that the second trigger measures only one current */
        self->p_output.currentReconstructionInfo.secondTriggerIsSum = false;
    }
    else
    {
        /* Set the flag that the second trigger measure two currents */
        self->p_output.currentReconstructionInfo.secondTriggerIsSum = true;
    }
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "Language scope code metric is justified because the second
 * parameter actually points to an array of unique compare values" */
static inline void Ifx_MAS_ModulatorF16_limitSwitchTimes(Ifx_MAS_ModulatorF16* self, sint16* cmprVal)
{
    uint8 i;

    /* Limit compare values */
    for (i = 0; i < 6; i++)
    {
        /* Set input to upper limit */
        if (cmprVal[i] > (self->p_period_tick / IFX_MAS_MODULATORF16_MAX_COMPARE_VALUE_RATIO))
        {
            cmprVal[i] = (self->p_period_tick / IFX_MAS_MODULATORF16_MAX_COMPARE_VALUE_RATIO);
        }

        /* Set input to lower limit */
        else if (cmprVal[i] < 0)
        {
            cmprVal[i] = 0;
        }
        else
        {
            /* Do nothing */
        }
    }
}


static inline void Ifx_MAS_ModulatorF16_calcTriggers(Ifx_MAS_ModulatorF16* self, sint16* cmprVal)
{
    if (self->p_currentMeasurement.p_measurementPoint == Ifx_MAS_ModulatorF16_measurementPoint_beginning)
    {
        /* Measuring from the begin */
        Ifx_MAS_ModulatorF16_measBegin(self, cmprVal);
    }
    else
    {
        /* Measuring from the end */
        Ifx_MAS_ModulatorF16_measEnd(self, cmprVal);
    }
}


static inline void Ifx_MAS_ModulatorF16_measBegin(Ifx_MAS_ModulatorF16* self, sint16* cmprVal)
{
    /* The measurement trigger during up-counting phase */
    self->p_output.triggerTime_tick[0] = (uint16)((sint16)(cmprVal[0] +
                                                           self->p_currentMeasurement.p_deltaBegin_tick));

    /* The measurement trigger during up-counting phase depends on the shifting pattern. */
    if (self->p_output.currentReconstructionInfo.secondTriggerIsSum == true)
    {
        self->p_output.triggerTime_tick[1] = (uint16)((sint16)((sint16)(self->p_period_tick - cmprVal[5]) +
                                                               self->p_currentMeasurement.p_deltaBegin_tick));
    }
    else
    {
        sint16 startingMeasurementWindow = cmprVal[3] < cmprVal[4] ? cmprVal[3] : cmprVal[4];
        self->p_output.triggerTime_tick[1] = (uint16)((sint16)((sint16)(self->p_period_tick -
                                                                        startingMeasurementWindow) +
                                                               self->p_currentMeasurement.p_deltaBegin_tick));
    }
}


static inline void Ifx_MAS_ModulatorF16_measEnd(Ifx_MAS_ModulatorF16* self, sint16* cmprVal)
{
    /* Temporary variables to hold the deltas */
    sint16 deltaEnd = self->p_currentMeasurement.p_deltaEnd_tick;

    /* Measuring from the beginning up */

    /* If the middle pulse is shifted to the right in bidirectional three phase shifting, the second switching event
     * could be the
     * middle pulse or the short pulse, find the second switching event to decide the current measurement window */
    sint16 endFirstMeasurementWindow = cmprVal[1] < cmprVal[2] ? cmprVal[1] : cmprVal[2];
    self->p_output.triggerTime_tick[0] = (uint16)((sint16)(endFirstMeasurementWindow - deltaEnd));

    /* Measuring from the end down */
    if (self->p_output.currentReconstructionInfo.secondTriggerIsSum == true)
    {
        /* After the shift of the long pulse, the last switching event could be the fixed pulse or the shift-to-left
         * pulse, find the second last switching event to decide the current measurement window */
        sint16 endSecondMeasurementWindow = cmprVal[3] < cmprVal[4] ? cmprVal[4] : cmprVal[3];
        self->p_output.triggerTime_tick[1] = (uint16)((sint16)((sint16)(self->p_period_tick -
                                                                        endSecondMeasurementWindow) - deltaEnd));
    }
    else
    {
        self->p_output.triggerTime_tick[1] = (uint16)((sint16)((sint16)(self->p_period_tick - cmprVal[5]) -
                                                               deltaEnd));
    }
}


/* polyspace-begin CODE-METRIC:VOCF [Justified:Low] "For performance reasons, the assignment of the compare values
 * according to the correct sector is implemented as a switch-case" */
static inline void Ifx_MAS_ModulatorF16_assignOutputs(Ifx_MAS_ModulatorF16* self, sint16* cmprVal)
{
    switch (self->p_output.currentReconstructionInfo.sector)
    {
        case 0:
            self->p_output.compareValues_tick[0] = (uint16)cmprVal[0];
            self->p_output.compareValues_tick[1] = (uint16)cmprVal[1];
            self->p_output.compareValues_tick[2] = (uint16)cmprVal[2];
            self->p_output.compareValues_tick[3] = (uint16)((sint16)(self->p_period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[4] = (uint16)((sint16)(self->p_period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[5] = (uint16)((sint16)(self->p_period_tick - cmprVal[5]));
            break;

        case 1:
            self->p_output.compareValues_tick[1] = (uint16)cmprVal[0];
            self->p_output.compareValues_tick[0] = (uint16)cmprVal[1];
            self->p_output.compareValues_tick[2] = (uint16)cmprVal[2];
            self->p_output.compareValues_tick[4] = (uint16)((sint16)(self->p_period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[3] = (uint16)((sint16)(self->p_period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[5] = (uint16)((sint16)(self->p_period_tick - cmprVal[5]));
            break;

