eaj40/TLE9879QXA40_eSL-BAS-EVALv1.0/1.3.0/TLE987x_FOC_BASIC_Sensorless_Example/RTE/TLE987x-eSL-BAS-EVAL/TLE9879QXA40/Ifx_MAS_ModulatorF16.c
        case 2:
            self->p_output.compareValues_tick[1] = (uint16)cmprVal[0];
            self->p_output.compareValues_tick[2] = (uint16)cmprVal[1];
            self->p_output.compareValues_tick[0] = (uint16)cmprVal[2];
            self->p_output.compareValues_tick[4] = (uint16)((sint16)(self->p_period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[5] = (uint16)((sint16)(self->p_period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[3] = (uint16)((sint16)(self->p_period_tick - cmprVal[5]));
            break;

        case 3:
            self->p_output.compareValues_tick[2] = (uint16)cmprVal[0];
            self->p_output.compareValues_tick[1] = (uint16)cmprVal[1];
            self->p_output.compareValues_tick[0] = (uint16)cmprVal[2];
            self->p_output.compareValues_tick[5] = (uint16)((sint16)(self->p_period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[4] = (uint16)((sint16)(self->p_period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[3] = (uint16)((sint16)(self->p_period_tick - cmprVal[5]));
            break;

        case 4:
            self->p_output.compareValues_tick[2] = (uint16)cmprVal[0];
            self->p_output.compareValues_tick[0] = (uint16)cmprVal[1];
            self->p_output.compareValues_tick[1] = (uint16)cmprVal[2];
            self->p_output.compareValues_tick[5] = (uint16)((sint16)(self->p_period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[3] = (uint16)((sint16)(self->p_period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[4] = (uint16)((sint16)(self->p_period_tick - cmprVal[5]));
            break;

        default:
            self->p_output.compareValues_tick[0] = (uint16)cmprVal[0];
            self->p_output.compareValues_tick[2] = (uint16)cmprVal[1];
            self->p_output.compareValues_tick[1] = (uint16)cmprVal[2];
            self->p_output.compareValues_tick[3] = (uint16)((sint16)(self->p_period_tick - cmprVal[3]));
            self->p_output.compareValues_tick[5] = (uint16)((sint16)(self->p_period_tick - cmprVal[4]));
            self->p_output.compareValues_tick[4] = (uint16)((sint16)(self->p_period_tick - cmprVal[5]));
            break;
    }
}


/* polyspace-end CODE-METRIC:VOCF [Justified:Low] "For performance reasons, the assignment of the compare values
 * according to the correct sector is implemented as a switch-case" */

#if IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION == 1
static inline void Ifx_MAS_ModulatorF16_compDeadTime(Ifx_MAS_ModulatorF16* self, sint16* cmprVal,
                                                     Ifx_Math_3PhaseFract16 currents)
{
    uint8 sector = self->p_output.currentReconstructionInfo.sector;

    /* Map the long, middle, short pulse back to phases */
    uint8 vecMapPhaseU[] = {0, 1, 2, 2, 1, 0};
    uint8 vecMapPhaseV[] = {1, 0, 0, 1, 2, 2};
    uint8 vecMapPhaseW[] = {2, 2, 1, 0, 0, 1};

    /* Compensate the dead time of each phases */
    Ifx_MAS_ModulatorF16_compPhaseDeadTime(self, cmprVal, currents.u, vecMapPhaseU[sector]);
    Ifx_MAS_ModulatorF16_compPhaseDeadTime(self, cmprVal, currents.v, vecMapPhaseV[sector]);
    Ifx_MAS_ModulatorF16_compPhaseDeadTime(self, cmprVal, currents.w, vecMapPhaseW[sector]);
}


static inline void Ifx_MAS_ModulatorF16_compPhaseDeadTime(Ifx_MAS_ModulatorF16* self, sint16* cmprVal,
                                                          Ifx_Math_Fract16 phaseCurrent, uint8 phaseOffset)
{
    if (phaseCurrent >= 0)
    {
        cmprVal[phaseOffset] = cmprVal[phaseOffset] - self->p_deadTimeCompensation;
    }
    else
    {
        cmprVal[phaseOffset] = cmprVal[phaseOffset] + self->p_deadTimeCompensation;
    }
}


#endif /* IFX_MAS_MODULATORF16_CFG_ENABLE_DEADTIME_COMPENSATION */

#if IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK != 0
static inline uint8 Ifx_MAS_ModulatorF16_checkMinOnTime(Ifx_MAS_ModulatorF16* self, sint16* cmprVal)
{
    /* Unsigned integer is used instead of bool to improve performance */
    uint8  isSevenSegment;

    /* Calculate the half of the minimum pulse length */
    sint16 halfMinimumPulseLength = (self->p_period_tick / 2) - cmprVal[2];

    /* Calculate switching time tLeft */
    sint16 tLeft = cmprVal[2] - cmprVal[1];

    /* Check if short pulse is smaller than the minimum turn on time and middle pulse is large enough for current
     * measurement */
    if ((halfMinimumPulseLength < self->p_minTurnOnTimeHalf_tick)
        && (tLeft > self->p_minSenseTime_tick / 2))
    {
        /* Compensate other phases */
        cmprVal[0] += halfMinimumPulseLength;
        cmprVal[1] += halfMinimumPulseLength;
        cmprVal[2] += halfMinimumPulseLength;

        /* After pulse elimination modulator is in 5 segment */
        isSevenSegment = 0u;
    }
    else
    {
        /* No elimination */
        isSevenSegment = 1u;
    }

    return isSevenSegment;
}


#endif /* IFX_MAS_MODULATORF16_CFG_MIN_ON_TIME_TICK */

/* polyspace-end MISRA2012:D4.14 [Justified:Low] "The caller function has to guarantee that NULL is not passed as
 * argument." */
